In [2]:
import pandas as pd
import numpy as np

In [3]:
emp = pd.read_csv('/Users/kalindjoshi/Desktop/ass3/employees.csv')
# reading the file from directory

In [4]:
emp.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,198,Donald,OConnell,DOCONNEL,650.507.9833,21-JUN-07,SH_CLERK,2600,-,124,50
1,199,Douglas,Grant,DGRANT,650.507.9844,13-JAN-08,SH_CLERK,2600,-,124,50
2,200,Jennifer,Whalen,JWHALEN,515.123.4444,17-SEP-03,AD_ASST,4400,-,101,10
3,201,Michael,Hartstein,MHARTSTE,515.123.5555,17-FEB-04,MK_MAN,13000,-,100,20
4,202,Pat,Fay,PFAY,603.123.6666,17-AUG-05,MK_REP,6000,-,201,20

In [5]:
emp.isnull().any()
# checking for any null values

EMPLOYEE_ID       False
FIRST_NAME        False
LAST_NAME         False
EMAIL             False
PHONE_NUMBER      False
HIRE_DATE         False
JOB_ID            False
SALARY            False
COMMISSION_PCT    False
MANAGER_ID        False
DEPARTMENT_ID     False
dtype: bool

In [6]:
emp = emp.drop(['JOB_ID', 'SALARY', 'COMMISSION_PCT', 'MANAGER_ID', 'DEPARTMENT_ID'], axis=1)
print(emp.head(4))

#dropping unwanted columns

   EMPLOYEE_ID FIRST_NAME  LAST_NAME     EMAIL  PHONE_NUMBER  HIRE_DATE
0          198     Donald   OConnell  DOCONNEL  650.507.9833  21-JUN-07
1          199    Douglas      Grant    DGRANT  650.507.9844  13-JAN-08
2          200   Jennifer     Whalen   JWHALEN  515.123.4444  17-SEP-03
3          201    Michael  Hartstein  MHARTSTE  515.123.5555  17-FEB-04

In [7]:
emp.columns = map(str.lower, emp.columns)
print(emp.head(4))

#converting column titles to lower case

   employee_id first_name  last_name     email  phone_number  hire_date
0          198     Donald   OConnell  DOCONNEL  650.507.9833  21-JUN-07
1          199    Douglas      Grant    DGRANT  650.507.9844  13-JAN-08
2          200   Jennifer     Whalen   JWHALEN  515.123.4444  17-SEP-03
3          201    Michael  Hartstein  MHARTSTE  515.123.5555  17-FEB-04

In [8]:
emp['first_name'] = emp['first_name'].str.lower()
emp['last_name'] = emp['last_name'].str.lower()
emp['email'] = emp['email'].str.lower()
emp['hire_date'] = emp['hire_date'].str.lower()

#converting all rows to lower case

In [9]:
emp.head()

   employee_id first_name  last_name     email  phone_number  hire_date
0          198     donald   oconnell  doconnel  650.507.9833  21-jun-07
1          199    douglas      grant    dgrant  650.507.9844  13-jan-08
2          200   jennifer     whalen   jwhalen  515.123.4444  17-sep-03
3          201    michael  hartstein  mhartste  515.123.5555  17-feb-04
4          202        pat        fay      pfay  603.123.6666  17-aug-05

In [11]:
emp['empsatisfaction'] = '1'
# adding empsatisfaction column

In [12]:
emp.head()

,employee_id,first_name,last_name,email,phone_number,hire_date,empsatisfaction
0,198,donald,oconnell,doconnel,650.507.9833,21-jun-07,1
1,199,douglas,grant,dgrant,650.507.9844,13-jan-08,1
2,200,jennifer,whalen,jwhalen,515.123.4444,17-sep-03,1
3,201,michael,hartstein,mhartste,515.123.5555,17-feb-04,1
4,202,pat,fay,pfay,603.123.6666,17-aug-05,1

In [13]:
emp.to_csv('/Users/kalindjoshi/Desktop/ass3/empclean.csv', index=False)

#saving the cleaned file as empclean.csv to the given address